FRM_COLOR = '#0d0d0d'
TXT_COLOR_1 = '#99ff66'
TXT_COLOR_2 = '#ffffff'
BTN_COLOR_1 = '#99ff66'
BTN_COLOR_2 = '#ffffff'
BTN_COLOR_3 = '#000000'

BTN_PARAMS = {
    "height": 50,
    "corner_radius": 50,
    "fg_color": BTN_COLOR_1,
    "hover_color": BTN_COLOR_2,
    "text_color": BTN_COLOR_3,
    "font": ('Constantia', 20)
}

ANSWER_WORDS = [
    'Бесспорно', 'Предрешено', 'Никаких сомнений',
    'Определённо да', 'Можешь быть уверен в этом',
    'Мне кажется - да', 'Вероятнее всего',
    'Хорошие перспективы', 'Знаки говорят - да', 'Да',
    'Пока неясно, попробуй снова', 'Спроси позже',
    'Лучше не рассказывать', 'Сейчас нельзя предсказать',
    'Сконцентрируйся и спроси опять', 'Даже не думай',
    'Мой ответ - нет', 'По моим данным - нет',
    'Перспективы не очень хорошие', 'Весьма сомнительно'
]

WAITING_WORDS = [
    'Жду ответа от Вселенной...', 'Посылаю запрос в космос...',
    'Звёзды просят немного подождать...', 'Дай-ка подумать...',
    'Получаю твой ответ...'
]

FAREWELL_WORDS = [
    'До новых встреч!',
    'Заглядывай ко мне ещё!',
    'Был рад поработать с тобой!',
    'Ты это, заходи, если что...',
    'Надеюсь, еще увидимся!'
]

ERROR_MESSAGES = {
    'empty': 'В поле пусто',
    'too_short': 'Слишком мало символов',
    'not_alpha': 'А как же буковки?',
    'not_question': 'Шару нужен этот значок в конце = "?"'
}

COLORS = [
    '#99ff66', '#ff1493', '#00ffff', '#ffe119', '#3cb44b', '#f58231', '#f032e6', '#bcf60c',
    '#fabebe', '#e6beff', '#fffac8', '#aaffc3', '#ffd8b1', '#ff00ff', '#00ff7f', '#1e90ff',
    '#ff8c00', '#ba55d3', '#adff2f', '#ff6347', '#40e0d0', '#7b68ee', '#00fa9a', '#ff4500',
    '#12cbc4', '#fda7df', '#ed4c67', '#a3cb38', '#2ed573', '#ff4757', '#ffa502', '#7efff5',
    '#fffa65', '#ffaf40', '#ff1e56', '#ffacb7', '#baffc9', '#ffb3ff', '#85e3ff', '#9797ff',
    '#e1ffb1', '#ffd3b6', '#ff8b94', '#ffaaa5', '#a8e6cf', '#dcedc1', '#ffd3b6', '#ff8b94',
    '#00ffcc', '#ccff00'
]

3